{
	"intro": "morvern are Jan Cizej, Luka Ivezić, Miha Konrad and Jay",
	"body": [
		"Trbovlje’s <b>morvern<\/b>, who has been living in Ljubljana since 2017, is the project of multi-instrumentalist and producer Jan Cizej. The so-called punk troubadour has been crafting a unique indie of free expression for more than a decade and in 2023 released the sixth studio album <b><i>Welcome to Hell<\/i><\/b> with his band. On it, they opened the door to their garage, the residence of <b>psychedelic rock with gleeful effects and punk that transforms apathy into a noisy dance<\/b>. Rawness and uncompromisingness are the essence of morvern. In the music scene that in majority bids a friendly welcome to the middle ground mainstream and correlates success with an elbowing egotism, Cizej firmly stands for the value of a <b>DIY approach<\/b> and collaboration.",
		"The project's discography includes more than 20 releases for the underground Ljubljana label <b>ŠOP Records<\/b>, in which elements of garage, psychedelic rock, art punk and even noise rock are mixed. In the broader picture, he represents a key member of the modern Slovenian guitar scene, where he stands alongside balans, Lelee, Rush to Relax, Čao portorož and others."
	],
	"contact": [{
		"name": "Špela Cvetko",
		"title": "Booking and PR",
		"company": "Music Laundry Press",
		"email": "spela@musiclaundrypress.si",
		"phone": "+386 51 270 202"
	}],
	"press": [
		{
			"text": "The one-man project of the prolific singer-songwriter/producer Jan Cizej has in recent years expanded into a playful five-piece ensemble, which on their home soil (Slovenia) persistently represents the indie underground unencumbered by trends. <i>Welcome To Hell<\/i>, a blend of lo-fi garage distortion, new-age psychedelia, and \"hellish\" b-horror aesthetics à la Braindead, is the most polished product in Morvern's extensive, stylistically diverse discography (26 releases from 2017 onwards!). This retro-sounding, wittily self-deprecating album unburdenly flirts with the \"trashy\" tendencies of King Gizzard and the incendiary riffs in the style of multi-instrumentalist John Dwyer. But it is not parody or pastiche, but a completely sincere tribute to the old and new psych-rock guard.",
			"author": "Jaša Bužinel",
			"publication": "Mladina",
			"link": "https://www.mladina.si/227388/morvern-welcome-to-hell/"
		},
		{
			"text": "With ease, spontaneity, mischievousness, heartfelt devotion and manic productivity, he has earned a striking reputation in the domestic underground scene as a little public secret, whose fame is growing.",
			"author": "Igor Bašin",
			"publication": "Odzven",
			"link": "https://www.sigic.si/slovo-od-samozadostnosti-.html"
		},
		{
			"text": "And the band morvern is exactly that: unconventional, imaginative, well-coordinated and, above all, passionate.",
			"author": "Miroslav Akrapović",
			"publication": "Odzven",
			"link": "https://www.sigic.si/dobrodosli-v-svet-morvern.html"
		}
	]
}