{
	"intro": "morvern are Jan Cizej, Luka Ivezić, Miha Konrad and Jay",
	"body": [
		"Trbovlje-Ljubljana’s morvern are punk troubadours, their residence, a garage under a carpenter’s workshop, a home to <b>psychedelic rock with gleeful effects and punk that transforms apathy into a noisy dance<\/b>. Their music takes us through a feverish ecstasy of riff permutations, broken at the right moment by distortion. Like everyone else, morvern are consumed by the emotional waste of this world, anger, melancholy, and sadness. But as lovers of trash and lo-fi, they digest life's garbage into fun. Rawness and uncompromisingness are precisely the essence of morvern. In a music scene that warmly welcomes middle normality and corrects success with the dictates of elbowing egoism, morvern firmly stand for the value of a <b>DIY approach<\/b> and collaboration.",
		"morvern's beginnings date back to 2016, when Jan Cizej began a singer-songwriter exploration of bedroom indie of free expression. Cizej as morvern moved from its start as a public secret on the underground Ljubljana label <b><a href=\"https://sop-records.org\" target=\"_blank\" rel=\"external\">ŠOP Records<\/a><\/b> to a band that, in the broader picture of Slovenian creativity represents a key member of the modern guitar scene, standing alongside balans, Lelee, Rush to Relax, Uryan and others. In 2023 they released the sixth studio album <b><i>Welcome to Hell<\/i><\/b> to great critical reception."
	],
	"contact": [{
		"name": "Špela Cvetko",
		"title": "Booking and PR",
		"company": "Music Laundry Press",
		"email": "spela@musiclaundrypress.si",
		"phone": "+386 51 270 202"
	}],
	"press": [
		{
			"text": "The one-man project of the prolific singer-songwriter/producer Jan Cizej has in recent years expanded into a playful five-piece ensemble, which on their home soil (Slovenia) persistently represents the indie underground unencumbered by trends. <i>Welcome To Hell<\/i>, a blend of lo-fi garage distortion, new-age psychedelia, and \"hellish\" b-horror aesthetics à la Braindead, is the most polished product in morvern's extensive, stylistically diverse discography (26 releases from 2017 onwards!). This retro-sounding, wittily self-deprecating album unburdenly flirts with the \"trashy\" tendencies of King Gizzard and the incendiary riffs in the style of multi-instrumentalist John Dwyer. But it is not parody or pastiche, but a completely sincere tribute to the old and new psych-rock guard.",
			"author": "Jaša Bužinel",
			"publication": "<a href=\"https://www.mladina.si/227388/morvern-welcome-to-hell/\" target=\"_blank\" rel=\"external\">Mladina<\/a>"
		},
		{
			"text": "With ease, spontaneity, mischievousness, heartfelt devotion and manic productivity, he has earned a striking reputation in the domestic underground scene as a little public secret, whose fame is growing.",
			"author": "Igor Bašin",
			"publication": "<a href=\"https://www.sigic.si/slovo-od-samozadostnosti-.html\" target=\"_blank\" rel=\"external\">Odzven<\/a>"
		},
		{
			"text": "And the band morvern is exactly that: unconventional, imaginative, well-coordinated and, above all, passionate.",
			"author": "Miroslav Akrapović",
			"publication": "<a href=\"https://www.sigic.si/dobrodosli-v-svet-morvern.html\" target=\"_blank\" rel=\"external\">Odzven<\/a>"
		}
	],
	"epk": "https://drive.google.com/drive/folders/1KmOCN1kzDndVTCLvVfKJ9_XAQLvZlSxd?usp=drive_link"
}